## Pandas: names

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import string

In [12]:
dt2000 = pd.read_csv('yob2000.txt',header=None, \
                     names=['nombre','sexo','cuenta'])
dt2000 = dt2000.set_index(['nombre','sexo'])
dt2000.head(2)

             cuenta
nombre sexo
Emily  F      25953
Hannah F      23078

In [15]:
dt2000.loc['Emily']

      cuenta
sexo
F      25953
M         30

In [17]:
dt2000.loc['Emily'].loc['F']

cuenta    25953
Name: F, dtype: int64

In [13]:
dt2016 = pd.read_csv('yob2016.txt',header=None, \
                     names=['nombre','sexo','cuenta'])
dt2016 = dt2016.set_index(['nombre','sexo'])
dt2016.head()

               cuenta
nombre   sexo
Emma     F      19414
Olivia   F      19246
Ava      F      16237
Sophia   F      16070
Isabella F      14722

In [22]:
#suma = dt2000 + dt2016
suma = dt2000.add(dt2016, fill_value=0)
suma=suma.sort_values(by='cuenta',ascending=False)
suma.head()

               cuenta
nombre  sexo
Jacob   M     48886.0
Michael M     46031.0
Matthew M     41123.0
Emily   F     36879.0
Joshua  M     36674.0